<script setup>
import Talk from "../components/Talk.vue";
import Tips from "../components/Tips.vue";
document.title = "关于 - 作者在这里等你很久了"
</script>

<template>
  <Tips title="路牌 - 关于" text="你想了解这个网站吗？来这里看看。" type="success"></Tips>
  <div class="centerDiv">
    <p>你好！我是网站，叫我 <b>“网站”、“0o0”、“0o0.life”</b> 都可以！</p>
    <p>嗯…… 我想想我要说什么来着…… 我不知道“开发者”那个家伙有没有跟你说过，但按照他的要求我得先自我介绍一下</p>
      <p>啊？“开发者”是谁啊…… 可能是个人类吧，不过他确实让我转达一个叫……“邮件”的东西？还挺长，<b><i>mq5kjioc@duck.com</i></b></p>
    <p>那是什么，你知道吗，人类？</p>
    <p>好吧，看来我一个计算机程序终究理解不了你们人类。</p>
    <p>我呢，诞生于 2024/02/26，“0o0.life”是“开发者”给我起的名字，似乎是一个特殊的符号？</p>
    <p>你说会不会有“<a href="https://1l1.icu">1l1.icu</a>”什么的？人类可真有意思啊……</p>
    <p>好的…… 那么…… 嗯…… 其实我觉得我没啥介绍的必要，因为听“开发者”说，我还没有……“完工”？我不确定这个词是什么意思。</p>
    <p>我也不知道我存在的意义是什么，也许你可以替我找开发者问问…… 套套话什么的…… 哦不，那太不道德了……</p>
    <p>不过，嘿！您猜怎么着，“开发者”让我转达的内容中，有一串符号长这样：</p>
    <p>https://0o0.life/-____-____</p>
    <p>这个我作为计算机程序可太熟了！让我猜猜…… “-”可能表示大写字母，“_”表示小写字母，一共 10 个字母，会是什么呢……</p>
    <p>“开发者说”这与他的兴趣爱好——计算机有关，哦…… 又难倒我了…… 我真没用…… qwq</p>
    <p>好吧…… 话说回来…… 开发者好像是希望我被“做”成一个集日记、备忘录、社区为一体即开即用的网站</p>
    <p>哦…… 可能“做”这个词你们人类不太好理解…… 嗐！没事！正是这样生活才有趣嘛！</p>
    <Talk></Talk>
  </div>
</template>
